Autodesk.Revit.DB.Structure.AnalyticalModel.CloneAdjustment(Autodesk.Revit.DB.Structure.AnalyticalModel,System.Int32)
The method clones the adjustment of one end of the AM on another AM,
with respect to the one of the ends.
One of the Analytical Model ends
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModel.SetOffset(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.XYZ)
Sets the offset of the analytical model at end.
selector:
End of analytical model to offset.
offset:
New offset for end of analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Function only work for curve-based elements.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.HasRigidLinksWith(Autodesk.Revit.DB.ElementId)
Indicates if Analytical Model has Rigid Links with specified element.
Remarks:
This is bidirectional, so this can be used to see if Rigid Links exist from Column to Beam.
neighborId:
neighboring Element, to which Rigid Links may exist.
Returns:
true if Rigid Links exist, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.ManuallyAdjust(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Perform Manual Analytical Adjustment on analytical model, with respect to another Element
Remarks:
Success is achieved when the Source adjusts itself against the Target.
Additionally, this requires an open transaction on the current document.
Model regeneration is required after the operation.
source:
Which part of Analytical Model needs to change.
target:
Which part of another Analytical Model change should be made against.
Returns:
Indicates the successful completion of the Manual Analytical Adjustment operation.
True if source Element was adjusted successfully, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if source cannot be used as source reference, or if target cannot be used as target reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidForManualAdjustment(Autodesk.Revit.DB.Reference)
Indicates if the identified reference is acceptable for Manual Analytical Adjustment.
Remarks:
This method is useful to determine if a reference is acceptable for Manual Analytical Adjustment in
general.  This looks briefly at the reference, without looking at the specific context.
reference:
Reference that will be examined.
Returns:
True if reference can be used, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidManualAdjustmentTarget(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if reference is acceptable as a "Target" for Manual Analytical Adjustment.
Remarks:
This method is useful for determining if a reference is acceptable for a target.
In other words, if the reference identifies an Analytical Model portion that can be adjusted against.
target:
Target reference.
source:
Source reference.  This is necessary to avoid illegal conditions.  For instance if Element A
is manually adjusted against Element B, Element B cannot in general be adjusted against Element A.
direction:
Direction in which source Element can be adjusted against target Element.
Returns:
True if reference can be used, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidManualAdjustmentSource(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.AnalyticalDirection)
Indicates if the identified reference is acceptable as a source for Manual Analytical Adjustment.
Remarks:
This method is useful for determining if a reference is acceptable for usage as a "Source".
In other words, if the reference identifies an Analytical Model portion that can be adjusted by the user.
source:
Reference to be examined.
adjustmentDirection:
Direction in which adjustment will occur.
Returns:
True if reference can be used as source; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This AnalyticalModel does not support Manual Analytical Adjustment.
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetRigidLink(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Returns rigid link curve corresponding to selector.
selector:
Identifies from which end of the analytical model to get the Rigid Link.
Returns:
Rigid link satisfying selector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
selector is not valid for this AnalyticalModel.
-or-
Thrown if selector identifies a entire curve instead of just an endpoint.
This is because this only returns one curve, and an entire analytical curve may have
any number of rigid links.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.GetReference(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Returns a reference to a given curve within the analytical model.
selector:
Specifies where in the analytical model the reference lies.
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
selector is not valid for this AnalyticalModel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Structure.AnalyticalModel.IsValidSelector(Autodesk.Revit.DB.Structure.AnalyticalModelSelector)
Indicates if the input selector is valid for the Analytical Model.
selector:
Portion of the analytical model geometry.
Returns:
True if selector is valid for this Analytical Model, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011